app/controllers/students_controller.rb

  def create
    redirect_to Student.create(params[:student])
---
INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Bill"], ["last_name", "Smith"], ["created_at", "2018-08-05 17:34:46.544369"], ["updated_at", "2018-08-05 17:34:46.544369"]]

  def update
    @student= Student.find(params[:id])
    @student.update(params[:student])
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Lindsey"], ["last_name", "Stirling"], ["updated_at", "2018-08-05 17:35:30.084111"], ["id", 1]]